## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:106" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:106" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:7d532864f2c92244dab5adeb8e763096eb43995201bd58b3dc1f06b1467a05dd" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:6adc89a3f40c4a3b537debefd61bae021e447e7dfd2b8ae0dc25a5d0c29b1117"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 106 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "1e7a0f68fac6fcb2bb33ec96d2947868-6" -> "904a8c51cee6884bf43de42fe432012c"
        id                     = "graphql.904a8c51cee6884bf43de42fe432012c.zip"
        tags                   = {}
      ~ version_id             = "jBUIbmaYNqn0DZldTU8tAWarl9pKSEAm" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "8f97754056f316a801dfefa7a96cc67e-5" -> "3d046486c7ff1f36316f2ad3ab262e5d"
        id                     = "processValidationJson.3d046486c7ff1f36316f2ad3ab262e5d.zip"
        tags                   = {}
      ~ version_id             = "3PUPqI55vxT1kJ0tB5FkVrMQS.ynvYX0" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.d5c783da6a03501537b3ea28bccbb118.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6236b97a47bc4c036b7b7470a0c5de7f-4" -> "4c823bc690c268f19ba174de0a8d54c4"
      ~ id                     = "python.d5c783da6a03501537b3ea28bccbb118.zip" -> (known after apply)
      ~ key                    = "python.d5c783da6a03501537b3ea28bccbb118.zip" -> "python.4c823bc690c268f19ba174de0a8d54c4.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "d5c783da6a03501537b3ea28bccbb118" -> "4c823bc690c268f19ba174de0a8d54c4"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "ZMd0.nrpwtnf7fFaTaNOM4ZHFl_QaA2e" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "02f0276e61e07b72a83c9addd2ca9277" -> "2c03c36cf6a6703795834d177648867a"
        id                     = "dist/200.html"
      ~ source_hash            = "02f0276e61e07b72a83c9addd2ca9277" -> "2c03c36cf6a6703795834d177648867a"
        tags                   = {}
      ~ version_id             = "TT6iuYDAdDYC5rvxwN9.GcCVmnJ9GZaP" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "dd877f1393270325a51f61ccc39631e0" -> "e1c218f420fde98b47676202acec58b8"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "dd877f1393270325a51f61ccc39631e0" -> "e1c218f420fde98b47676202acec58b8"
        tags                   = {}
      ~ version_id             = "Dp4E1Trq0vDx6Tlcd52zJmJjWMGNc4DD" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "2aad70136c718d3e7210a48d342e3b24" -> "4e80e6bbd4aac287444ca0f6764923dc"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "2aad70136c718d3e7210a48d342e3b24" -> "4e80e6bbd4aac287444ca0f6764923dc"
        tags                   = {}
      ~ version_id             = "GYVrrvpP6TjwiWbIkPsptuxNv5Jsnp5i" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "02f0276e61e07b72a83c9addd2ca9277" -> "2c03c36cf6a6703795834d177648867a"
        id                     = "dist/index.html"
      ~ source_hash            = "02f0276e61e07b72a83c9addd2ca9277" -> "2c03c36cf6a6703795834d177648867a"
        tags                   = {}
      ~ version_id             = "ZjfR8ob42viis2sOLfF0uFXJvPRBVS4M" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.e61ab9a9.js"] will be destroyed
  # (because key ["static/js/app.e61ab9a9.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.e61ab9a9.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "38c88412eae4c9414fd8ce323cdf1c3f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.e61ab9a9.js" -> null
-       key                    = "dist/static/js/app.e61ab9a9.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.e61ab9a9.js" -> null
-       source_hash            = "38c88412eae4c9414fd8ce323cdf1c3f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "fT9SUkaLCD0Tr_XX0qHCFDSnKtoBhUsN" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.e61ab9a9.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.e61ab9a9.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.e61ab9a9.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.e61ab9a9.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.e61ab9a9.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.e61ab9a9.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "6OXq8p6vP7nTeztiX4sw32VpSERU.OWU" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-18T21:29:30.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:73" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:73/invocations" -> (known after apply)
      ~ s3_key                         = "python.d5c783da6a03501537b3ea28bccbb118.zip" -> "python.4c823bc690c268f19ba174de0a8d54c4.zip"
        tags                           = {}
      ~ version                        = "73" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "34b96323e012f81179def9c721d1f6a05c4cb305" -> "d772f5435d1b4853ed94e0da80f015a593fb8ffe"
              ~ "DD_TAGS"                      = "git.commit.sha:34b96323e012f81179def9c721d1f6a05c4cb305,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:d772f5435d1b4853ed94e0da80f015a593fb8ffe,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "34b96323e012f81179def9c721d1f6a05c4cb305" -> "d772f5435d1b4853ed94e0da80f015a593fb8ffe"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "73" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:121" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:121/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "121" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "34b96323e012f81179def9c721d1f6a05c4cb305" -> "d772f5435d1b4853ed94e0da80f015a593fb8ffe"
              ~ "DD_TAGS"                            = "git.commit.sha:34b96323e012f81179def9c721d1f6a05c4cb305,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:d772f5435d1b4853ed94e0da80f015a593fb8ffe,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "34b96323e012f81179def9c721d1f6a05c4cb305" -> "d772f5435d1b4853ed94e0da80f015a593fb8ffe"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "121" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:29" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:29/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "29" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "34b96323e012f81179def9c721d1f6a05c4cb305" -> "d772f5435d1b4853ed94e0da80f015a593fb8ffe"
              ~ "DD_TAGS"                            = "git.commit.sha:34b96323e012f81179def9c721d1f6a05c4cb305,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:d772f5435d1b4853ed94e0da80f015a593fb8ffe,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "34b96323e012f81179def9c721d1f6a05c4cb305" -> "d772f5435d1b4853ed94e0da80f015a593fb8ffe"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "29" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8789282375)*